org-jira.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>org-jira</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-01-07 21:04:03 China Standard Time"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="css/default.css" type="text/css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">org-jira</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction </a></li>
<li><a href="#sec-2">2 Features </a>
<ul>
<li><a href="#sec-2-1">2.1 Sync Jira tickets into Org-mode todo items in a batch mode </a></li>
<li><a href="#sec-2-2">2.2 Update Org-mode new edits back to Jira </a></li>
<li><a href="#sec-2-3">2.3 Progress Jira ticket workflow in Org-mode </a></li>
<li><a href="#sec-2-4">2.4 Create new Jira issue in org mode </a></li>
<li><a href="#sec-2-5">2.5 Convert existing org mode TODO item into Jira ticket </a></li>
<li><a href="#sec-2-6">2.6 Edit existing Jira comments / add new comment </a></li>
<li><a href="#sec-2-7">2.7 Open current issue in browser </a></li>
</ul>
</li>
<li><a href="#sec-3">3 Usage </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction </h2>
<div class="outline-text-2" id="text-1">


<p>
(For the latest verion of this page, visit <a href="http://baohaojun.github.com/org-jira.html">this github page</a>.
</p>
<p>
<a href="http://orgmode.org">Org-mode</a> is the best GTD (get things done) tool I have used. If you
didn't use it, please consider give it a shot.
</p>
<p>
Jira is, well, a very popular Bug Tracking system. Two companies in a
row where I worked chose Jira for bug tracking, task management, etc.
</p>
<p>
As an emacs enthusiast, I very much want to be able to use Jira within
Emacs. Thus I started digging the web for a solution.
</p>
<p>
To use Jira without the browser, you can use a) xmp-rpc, b) soap, c)
REST. I don't know what the last one is, but their supported degree by
Jira is in ascending order. The former 2 protocols has both been
supported by Emacs plugin: <a href="https://launchpad.net/xml-rpc-el">xml-rpc</a> and <a href="http://code.google.com/p/emacs-soap-client/">soap</a>.
</p>
<p>
For xml-rpc, there is already a <a href="http://www.emacswiki.org/emacs/org-jira.el">jira.el</a>, but it is not satisfactory for me:
</p>
<ul>
<li>xml-rpc is not as well supported as soap by Jira.
</li>
<li>jira.el is a stand-alone tool, while I want to integrate with
  org-mode.
</li>
</ul>


<p>
Luckily, the emacs-soap-client guy(s) already provided a sample
jira2.el, so I started hacking by combining jira.el and jira2.el, the
result is jiralib.el <a href="http://github.com/baohaojun/org-jira/raw/master/jiralib.el">here</a> (people suggested jira2.el is not a good
name, as it can be quite confusing what the 2 means, and I totally
agree, thus the name jiralib).
</p>
<p>
After browsing Jira with jira2.el is implemented, I checked <a href="https://github.com/punchagan/org2blog">org2blog</a>
for ideas of how to hack on org-mode, and started from his org2blog.el
and hacked into a new <a href="http://github.com/baohaojun/org-jira/raw/master/org-jira.el">org-jira.el</a>.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Features </h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Sync Jira tickets into Org-mode todo items in a batch mode </h3>
<div class="outline-text-3" id="text-2-1">


<p>
Jira ticket attributes such as priority, status, resolution, summary,
description, etc. are supported. New ones can be added if desired by
hacking the elisp.
</p>
<p>
See the following example. Jira ticket summary has been used as the
Org TODO headline; most Jira ticket attributes have been made into Org
entry; Jira description attribute is made into a separate subtitle
because unlike most attributes it is multi-line.
</p>



<pre class="example">* TODO test summary                                          :SANDBOX_22:
  :PROPERTIES:
  :assignee: hjbao
  :reporter: hjbao
  :type:     Bug
  :priority: Major
  :status:   Open
  :ID:       SANDBOX-22
  :END:

** description: SANDBOX-22
test description
** Comment: Bao Haojun
   :PROPERTIES:
   :ID:       21322
   :END:
test comment
</pre>



<p>  
Also note the ID Org entry, both the Jira issue and Jira comment has
an attribute ideal for this entry. Org-mode has an API for finding
heading from ID entry.
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Update Org-mode new edits back to Jira </h3>
<div class="outline-text-3" id="text-2-2">


<p>
After you edit the attributes, such as change priority from "Major" to
"Minor", you can post it back the Jira.
</p>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Progress Jira ticket workflow in Org-mode </h3>
<div class="outline-text-3" id="text-2-3">

<p>You can Resolve/Close/Reopen the jira ticket and so on, without leaving org-mode!
</p>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Create new Jira issue in org mode </h3>
<div class="outline-text-3" id="text-2-4">


<p>
You can create new Jira issue within org mode. You will be prompted
for Jira ticket information such as create in which project, assign to
whom, and one-line summary, etc.
</p>
</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Convert existing org mode TODO item into Jira ticket </h3>
<div class="outline-text-3" id="text-2-5">


<p>
This one is similar to the create-new-issue case, except the existing
TODO headline can be used for Jira ticket summary.
</p>
<p>
The old TODO is deleted. But you will not lose a TODO entry, instead,
you will trade a normal TODO for a Jira ticket tracked TODO.
</p>
</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Edit existing Jira comments / add new comment </h3>
<div class="outline-text-3" id="text-2-6">


<p>
These are also supported.
</p>
</div>

</div>

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> Open current issue in browser </h3>
<div class="outline-text-3" id="text-2-7">


<p>
Last but not least, if you think org-jira can not perform some tasks
you wanted, you can press a key combination (default "C-c i b") to
open the current issue in an external browser such as firefox.
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Usage </h2>
<div class="outline-text-2" id="text-3">


<p>
To use org-jira.el, get the .el files from <a href="https://github.com/baohaojun/org-jira">org-jira on github</a>. 
</p>


<pre class="example">git clone git://github.com/baohaojun/org-jira.git
</pre>



<p>   
(In my repository, I have included the emacs-soap files, which you can
get from its project, but in my version I fixed an utf-8 encoding bug
in it so that I can post comments in Chinese).
</p>

<p>
Then put the following in your .emacs, 
</p>


<pre class="src src-emacs-lisp">(setq jiralib-url <span style="color: #3AA221;">"http://jira-host/jira"</span>)
<span style="color: #ff0000;">; </span><span style="color: #ff0000; font-style: italic;">you need make sure the jiralib-url is correct. Login your jira</span>
<span style="color: #ff0000;">; </span><span style="color: #ff0000; font-style: italic;">server in browser, the home page URL should be like:</span>
<span style="color: #ff0000;">; </span><span style="color: #ff0000; font-style: italic;">https://issues.apache.org/jira/secure/Dashboard.jspa</span>
<span style="color: #ff0000;">; </span><span style="color: #ff0000; font-style: italic;">remove the "/secure/Dashboard.jspa" part and you get the jiralib-url: </span>
<span style="color: #ff0000;">; </span><span style="color: #ff0000; font-style: italic;">"https://issues.apache.org/jira"</span>

(<span style="color: #ff00ff;">require</span> '<span style="color: #00ffff;">org-jira</span>) 
<span style="color: #ff0000;">; </span><span style="color: #ff0000; font-style: italic;">jiralib is not explicitly required, since org-jira will load it</span>
</pre>




<p> 
(If you have a ~/.authinfo file and corresponding entry for jira-host,
the username and password will be computed from that; or else you will
be prompted for password).
</p>
<p>  
Then start syncing with <code>M-x org-jira-get-issues</code> .
</p>


</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-01-07 21:04:03 China Standard Time</p>
<p class="author">Author: </p>
<p class="creator">Org version 7.7 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
